In [1]:
import pandas as pd
emi_df = pd.read_csv("Emission data.csv")
emi_df.head(2)

,Unnamed: 0,year,population,Commer_Gas_Consumption_Emission,Distribution_of_Gas_Emission,Vehicular_Emissions,Railway_Emissions,Boating_Emissions,Aviation_Emissions,SolidWaste_Emissions,WasteWater_Treatment_Emissions,Total_emissions
0,0,2019,178955,170602,42678,570176,4396,77915,42,284576,7847,1158232
1,1,2018,169961,165523,41759,534450,4396,75427,42,278212,7580,1107389

In [2]:
cols = list(emi_df.columns)
cols.pop(0)
print(cols)

['year', 'population', 'Commer_Gas_Consumption_Emission', 'Distribution_of_Gas_Emission', 'Vehicular_Emissions', 'Railway_Emissions', 'Boating_Emissions', 'Aviation_Emissions', 'SolidWaste_Emissions', 'WasteWater_Treatment_Emissions', 'Total_emissions']

In [3]:
f = open("Query1.txt", "a")
str_cols = str(cols)
str_cols = str_cols.replace("[","(")
str_cols = str_cols.replace("]",")")
for i in emi_df.index:
    
    f.write("INSERT INTO `emissions` ")
    f.write(" VALUES (")
    f.write(str(emi_df.iloc[i]['year']) + ", " + str(emi_df.iloc[i]['population'])+", "+ str(emi_df.iloc[i]['Commer_Gas_Consumption_Emission'])+", "+
           str(emi_df.iloc[i]['Distribution_of_Gas_Emission']) + ", " +str(emi_df.iloc[i]['Vehicular_Emissions'])+ ", " + str(emi_df.iloc[i]['Railway_Emissions'])+", "+ 
            str(emi_df.iloc[i]['Boating_Emissions'])+ ", " + str(emi_df.iloc[i]['Aviation_Emissions']) + ", " +str(emi_df.iloc[i]['SolidWaste_Emissions'])+", "+
            str(emi_df.iloc[i]['WasteWater_Treatment_Emissions'])+ ", " + str(emi_df.iloc[i]['Total_emissions']))
    f.write(str(");"))
    f.write("\n")
f.close()

In [4]:
se_df = pd.read_csv("Sea and Land Temp data.csv")
se_df.head(2)

   Unnamed: 0  Year  Sea-surface temperature   Surface air temperature
0          90  2000                      0.35                    -0.15
1          91  2001                      0.40                    -0.06

In [5]:
cols1 = ['Year', 'sea_temp', 'land_air_temp']
f1 = open("Query2.txt", "a")
str_cols1 = str(cols1)
str_cols1 = str_cols1.replace("[","(")
str_cols1 = str_cols1.replace("]",")")
print(str_cols1)
for i in se_df.index:  
    f1.write("INSERT INTO `SeaLandTemp` ")
    f1.write(" VALUES (")
    f1.write(str(se_df.iloc[i]['Year']) +", "+str(se_df.iloc[i]['Sea-surface temperature ']) +", "+ str(se_df.iloc[i]['Surface air temperature'] ))
    f1.write(str(");"))
    f1.write("\n")
f1.close()

('Year', 'sea_temp', 'land_air_temp')

In [6]:
se_df1 = pd.read_csv("Rainfall and Temperature data.csv")
se_df1.head(2)

   Unnamed: 0  Year  Avg_rain  Avg_Temp
0           0  2000     33.61     45.98
1           1  2001     24.13     45.06

In [7]:
cols2 = ['Year', 'avg_rainfall', 'avg_temperature']
f2 = open("Query3.txt", "a")
str_cols2 = str(cols2)
str_cols2 = str_cols2.replace("[","(")
str_cols2 = str_cols2.replace("]",")")
for i in se_df1.index:
    
    f2.write("INSERT INTO `Avg_Rainfall_Temperture` ")
    f2.write(" VALUES (")
    f2.write(str(se_df1.iloc[i]['Year']) +", "+str(se_df1.iloc[i]['Avg_rain']) +", "+ str(se_df1.iloc[i]['Avg_Temp'] ))
    f2.write(str(");"))
    f2.write("\n")
f2.close()